# Pandas

* Pandas is a python library that working with data sets and is used for Analyzing, Cleaning, Exploring and Manipulating data.
* Read and Write with different formates like JSON, SVG, Zip etc.
* Pandas allow us to analyze big data and make conclusions based on statistical theories
* Pandas can clean messy data sets and make them readable and relevant
* Easy handling of missing data(Represented as NaN) in floating point as well as Non-Floating point data
* Size mutability: Columns can be inserted and deleted from dataFrames and higher dimensional objects
* Data set merging and joining: Flexible Reshaping and pivoting data sets
 
__Pandas 3 types k data Structures use krta hai__

1) **Series** ---> One dimensional labbled arrays pd.Series(data) **Note!**(series ka S hm capital likhty hn)
2) **DataFrames** ----> Two dimensional Data Structure with the columns, much like a table
3) **Panel** ----> A Panel is a 3D Container of data

# Series

In [1]:
import pandas as pd
x=[3,4,5,6,7]
var=pd.Series(x,index=['a','b','c','d','e'],dtype="float",name="python")
print(var)
print(type(var))
print(var[2])

a    3.0
b    4.0
c    5.0
d    6.0
e    7.0
Name: python, dtype: float64
<class 'pandas.core.series.Series'>
5.0

In [2]:
dic={"name":['python','java','c++','c'],"popular":[12,13,14,15],"rank":[1,4,3,2]}
var1=pd.Series(dic)
print(var1)

name       [python, java, c++, c]
popular          [12, 13, 14, 15]
rank                 [1, 4, 3, 2]
dtype: object

In [4]:
s=pd.Series(12,index=[1,2,3,4,5,6,7])
print(s)
print(type(s))

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
s1=pd.Series(12,index=[1,2,3,4,5,6,7])
s2=pd.Series(12,index=[1,2,3,4])
print(s1+s2)

1    24.0
2    24.0
3    24.0
4    24.0
5     NaN
6     NaN
7     NaN
dtype: float64

# DataFrame

DtaFrame k liye hm list ya dictionary kisi ki b help ly skty hn. DataFrames pandas k andr hmary pas aik 2D dataStructure hota
hai.jb hm dictionary ka use kren gy to hm ko keys ki value equal dyni hogi nii to error ajaye ga

### DataFrame using list

In [8]:
import pandas as pd
l=[1,2,3,4,5,6]

var=pd.DataFrame(l)

print(type(var))

<class 'pandas.core.frame.DataFrame'>

### DataFrame using Dictionary

In [11]:
d={'a':[1,2,3,4],'s':[5,6,7,8],'b':[1,2,3,4],'c':[1,2,3,4]:1:[1,2,3,4]}   Note! (jb hm dictionary ka use kren gy to hm ko keys ki value equal dyni hogi nii to error ajaye ga)

var=pd.DataFrame(d,column=['a',1],index=['a','b','c','d','e'])

print(type(var))
print(var)
print(var['a'][2])

<class 'pandas.core.frame.DataFrame'>

### DataFrame using list within a list

In [13]:
list_1=[[1,2,3,4,5],[6,7,8,9,10]]

var2=pd.DataFrame(list_1)

print(type(var2))
print(var2)

<class 'pandas.core.frame.DataFrame'>
   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

### DataFrames using Series

In [14]:
sr={'s':pd.Series([1,2,3,4]),'r':pd.Series([1,2,3,4])} Note! (yahan dictionary k undr series ka use kia gya hai)

var3=pd.DataFrame(sr)

print(type(var3))
print(var3)

<class 'pandas.core.frame.DataFrame'>
   s  r
0  1  1
1  2  2
2  3  3
3  4  4

# Arithmetic Operations In Pandas

In [15]:
var = pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})

var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [16]:
var['C']= var['A'] + var['B']
var

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [17]:
var['C']= var['A'] - var['B']
var

   A  B  C
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

In [18]:
var['C']= var['A'] * var['B']
var

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [19]:
var['C']= var['A'] / var['B']
var

   A  B         C
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

# Logical Operations in Pandas

In [20]:
var = pd.DataFrame({'A':[10,20,30,40],'B':[15,16,17,18]})

var

    A   B
0  10  15
1  20  16
2  30  17
3  40  18

In [22]:
var['C']= var['A'] <= 20
var['D']= var['B'] <= 16
var

    A   B      C      D
0  10  15   True   True
1  20  16   True   True
2  30  17  False  False
3  40  18  False  False

# How to Delete and Insert Data in Pandas DataFrame

### Insert

###### insert function mn hmary pas 3 parameters hoty hn

1. Index number ------- yani kis index number pr hm value dalna chahty hn
2. jo naya column insert ho raha hai vo kis position pr insert hoga r uska name kya hoga
3. 3rd vo parameter hota hai k ap kya data insert krna chahty hn

In [24]:
var=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})

var Note! (yahan mn akeela var ki jaga print(var) bhi likh skti hon)

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [25]:
var.insert(1,"python",var['A'])

var

   A  python  B
0  1       1  5
1  2       2  6
2  3       3  7
3  4       4  8

In [26]:
**Note! insert krty wqt jo new data hai vo pehly waly data ki tadad k braber hona chahiye ni to error aye ga**

SyntaxError: invalid syntax (3364261074.py, line 1)

In [29]:
var.insert(1,"python_1",[22,33,44,55])

var

   A  python_1  python  B
0  1        22       1  5
1  2        33       2  6
2  3        44       3  7
3  4        55       4  8

In [30]:
var=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})

var["python_2"]= var['A'][:3] **Note!** (yahan slicing ka use kia gya hai r yahan 3 se muraz n-1 hoga yani ye 0-2 tk index lyga)

var

   A  B  python_2
0  1  5       1.0
1  2  6       2.0
2  3  7       3.0
3  4  8       NaN

### Delete

Delete krny k liye hm pop r del ka keyword use krskty hn

In [34]:
var=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8],'G':[33,44,55,66]})

var3=var.pop('B')

var3

0    5
1    6
2    7
3    8
Name: B, dtype: int64

In [35]:
del var['A']

var

    G
0  33
1  44
2  55
3  66

# How to Create Pandas CSV Files

* CSV file is a plained text formate in which values are seprated by commas(comma seprated values)

* XLS file formate is an excel sheet binary file formate which hold information about all the worksheet in the file, including
  both content and formatting.
* CSV file k liye hmein aik variable ki zrort hoti h

In [1]:
import pandas as pd

In [7]:
dis={'a':[1,2,3,4,5,6],'b':[1,2,3,4,5,6],'c':[1,2,3,4,5,6]}

d=pd.DataFrame(dis)

print(d)

d.to_csv("test_new.csv")

   a  b  c
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5  6  6  6

In [8]:
dis={'a':[1,2,3,4,5,6],'b':[1,2,3,4,5,6],'c':[1,2,3,4,5,6]}

d=pd.DataFrame(dis)

print(d)

d.to_csv("test_new1.csv",index=False) Note! (index = False is used to remove index numbers)

   a  b  c
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5  6  6  6

In [11]:
dis={'a':[1,2,3,4,5,6],'b':[1,2,3,4,5,6],'c':[1,2,3,4,5,6]}

d=pd.DataFrame(dis)

print(d)

d.to_csv("test_new2.csv",index=False,header=['A','B','C'])

   a  b  c
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5  6  6  6

# How to read CSV files in python pandas

In [3]:
import pandas as pd

In [5]:

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1

   Unnamed: 0  a  b  c
0           0  1  1  1
1           1  2  2  2
2           2  3  3  3
3           3  4  4  4
4           4  5  5  5
5           5  6  6  6

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv",nrows=1)
      <!--- nrows is used to fetch a specific row from the data --->
csv_1
print(type(csv_1))

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv",usecols=['b','c'])
      <!--- usecols is used to fetch a specific columns from the data in sequre brkts we can use cols name as well as index
            numbers --->
csv_1

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv",skiprows=[0])
              <!--- skiprows=[0] is used to skip a row or multipule rows from the data --->
csv_1

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv",index_col=['a'])

     <!--- index_col=['a'] is used to make a specific columns as a index number --->

csv_1

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv",header=2)

     <!--- header=2 is used to make a specific row to a header --->

csv_1


csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv",names=["col1","col2","col3","col4"])

<!---names=["col1","col2","col3","col4"] is used to change the header name hmko hr name alg alg rkhna hai same name nii dyna--->
csv_1


csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv",header=None,prefix="col")


csv_1

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv",dtype={'a':"float"})

<!--- dtype={'a':"float"} is used to change the datatype of our value--->
csv_1

## Functions related to CSV files and we can also use these functions in DataFrames

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.index 

Note! (index function yahan hmko bta raha hai k index kahan se start ho raha hai kahan end ho raha hai r kitny k gap se araha h)

In [18]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.columns

Note! (columns function yahan hmko jitny b columns hn hmary data mn vo lakr dy raha hai)

Index(['Unnamed: 0', 'a', 'b', 'c'], dtype='object')

In [20]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.describe()

Note! (describe ka function hmko mean std min max 25% 75% etc value nikal kr dyta h hmaey data ki)

       Unnamed: 0         a         b         c
count    6.000000  6.000000  6.000000  6.000000
mean     2.500000  3.500000  3.500000  3.500000
std      1.870829  1.870829  1.870829  1.870829
min      0.000000  1.000000  1.000000  1.000000
25%      1.250000  2.250000  2.250000  2.250000
50%      2.500000  3.500000  3.500000  3.500000
75%      3.750000  4.750000  4.750000  4.750000
max      5.000000  6.000000  6.000000  6.000000

In [21]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.head()

!Note (head ka function yaha hmary data ki pehli 5 value lakr dyta hai ya hm kehskty hn k pehli 5 rows lakr dyta hai)

   Unnamed: 0  a  b  c
0           0  1  1  1
1           1  2  2  2
2           2  3  3  3
3           3  4  4  4
4           4  5  5  5

In [22]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.head(2)

!Note (head ka function yaha hmary data ki pehli 5 value lakr dyta hai ya hm kehskty hn k pehli 5 rows lakr dyta hai lykin jb hm
      head mn koi numbr ya value pas kr dyty hn to vo us hisab se value show krwata hai like yahan head mn hmny 2 dia to ye 
      pehli 2 rows ka data lakr dyga )

   Unnamed: 0  a  b  c
0           0  1  1  1
1           1  2  2  2

In [23]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.tail()

!Note (tail ka function yaha hmary data ki akhri 5 value lakr dyta hai ya hm kehskty hn k last 5 rows lakr dyta hai)

   Unnamed: 0  a  b  c
1           1  2  2  2
2           2  3  3  3
3           3  4  4  4
4           4  5  5  5
5           5  6  6  6

In [24]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.tail(2)

!Note (tail ka function yaha hmary data ki akhri 5 value lakr dyta hai ya hm kehskty hn k last 5 rows lakr dyta hai lykin jb hm
      head mn koi numbr ya value pas kr dyty hn to vo us hisab se value show krwata hai like yahan tail mn hmny 2 dia to ye 
      last ki 2 rows ka data lakr dyga )

   Unnamed: 0  a  b  c
4           4  5  5  5
5           5  6  6  6

In [26]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1[:2]

!Note (yaha ye jo csv_1[:2] ka use kia gya hai ye aik string slicing ki trhan use kia gya hai r usi trhan work kry ga ... yani
      iska mtlb hai k hmko kahan se kahan tk ka data chahiye)

   Unnamed: 0  a  b  c
0           0  1  1  1
1           1  2  2  2

In [27]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1[0:3]

!Note (yaha ye jo csv_1[0:3] ka use kia gya hai ye aik string slicing ki trhan use kia gya hai r usi trhan work kry ga ... yani
      iska mtlb hai k hmko kahan se kahan tk ka data chahiye)

   Unnamed: 0  a  b  c
0           0  1  1  1
1           1  2  2  2
2           2  3  3  3

In [32]:
print(type(csv_1))

<class 'pandas.core.frame.DataFrame'>

In [33]:
csv_1.index.array
!Note (.index.array is used to show our CSV file index in the for of array)

<PandasArray>
[0, 1, 2, 3, 4, 5]
Length: 6, dtype: int64

In [34]:
csv_1.to_numpy()

!Note (.to_numpy() function is used to show our CSV file data in the for of numpy array)

array([[0, 1, 1, 1],
       [1, 2, 2, 2],
       [2, 3, 3, 3],
       [3, 4, 4, 4],
       [4, 5, 5, 5],
       [5, 6, 6, 6]], dtype=int64)

In [35]:
import numpy as np

r=np.asarray(csv_1)

r

!Note (this method is also used to convert our data in the form of numpy array)

array([[0, 1, 1, 1],
       [1, 2, 2, 2],
       [2, 3, 3, 3],
       [3, 4, 4, 4],
       [4, 5, 5, 5],
       [5, 6, 6, 6]], dtype=int64)

In [36]:
csv_1.sort_index(axis=0,ascending=False)

!Note (this method is also used to sort our data in the form of decending order)

   Unnamed: 0  a  b  c
5           5  6  6  6
4           4  5  5  5
3           3  4  4  4
2           2  3  3  3
1           1  2  2  2
0           0  1  1  1

In [38]:
csv_1.loc[0,"b"]=8
          
csv_1

!Note (this method is use to change the value in a column .... csv_1.loc[0,"b"]=8 iss mn hm rows r columns pas kr rhy hoty
       hein r = lga kr vo value likhty hn jo hm chng krwa kr likhna chah rhy hoty hn orignal ki jga )

   Unnamed: 0  a  b  c
0           0  1  8  1
1           1  2  2  2
2           2  3  3  3
3           3  4  4  4
4           4  5  5  5
5           5  6  6  6

In [42]:
Note! loc function k through hm kisi aik particular data ko b get krskty hn

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.loc[[2,3],["a","b"]]

   a  b
2  3  3
3  4  4

In [44]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.loc[:,["a","b"]] !Note (ye 'a' and 'b' ka sara data get krny ka treeqa hai aik)

   a  b
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
5  6  6

In [45]:
csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1.loc[[2,3],:]  !Note (ye 2 and 3 row ka sara data get krny ka aik treeqa hai)

   Unnamed: 0  a  b  c
2           2  3  3  3
3           3  4  4  4

In [47]:
csv_1.iloc[0,2]

1

In [48]:
csv_1.drop("b",axis=1) 

!Note drop hm koi  b column ya row ko delete krny k liye use krty hn .... r jb hm axis mn 0 dyty hn to
uska mtlb hota hai row r jb hm 1 dyty hn to uska mtlb hota h column)

   Unnamed: 0  a  c
0           0  1  1
1           1  2  2
2           2  3  3
3           3  4  4
4           4  5  5
5           5  6  6

In [ ]:
csv_1.drop(1,axis=1) !Note ye treeqa use kren gy kisi b aik specific column ko delete / drop keny k liye

# Handling Missing Data (Dropna & Fillna) in CSV fies

In [1]:
import pandas as pd

csv_1 = pd.read_csv("C:\\Users\\H-H Traders\\Desktop\\Python_Learning\\Pandas_CSV_files\\test_new.csv")

csv_1

   Unnamed: 0  a  b  c
0           0  1  1  1
1           1  2  2  2
2           2  3  3  3
3           3  4  4  4
4           4  5  5  5
5           5  6  6  6

### Dropna

In [ ]:
csv_1.dropna() !Note (ye use hota hai kisi bhi NAN value ko remaove krny k liye ... ye vo pouri row hi remove kr dyta hai jis
                      mn NAN value exist kr rhi ho)

In [ ]:
csv_1.dropna(axis=1)  !Note (iss mn hm axis ka use krskty hein ... like axis=1 column ko remove krta hai jis mn NAN value exist
                            kr rhi ho r axis=0 us row ko remove krta hai jis mn NAN value exist kr rhi ho)

In [ ]:
csv_1.dropna("any")  !Note (ye usky liye kam ata hai any k agr hmary pas kisi row mn sbi value NAN ho to us pouri row ko 
                           remove krny k liye ye any use hota hai)

In [ ]:
csv_1.dropna("all") !Note (ye usko to htta dy ka jis row mn sbi value NAN hongi pr kisi row mn koi aik do value NAN hon to usko
                          nii httay ga usko show krwaye ga ye data mn)

In [ ]:
csv_1.dropna(subset=["python"]) !Note (iss mn hm ny aik parameter pas kia hai jiska name subset hai r usky bad [] brackets mn 
                                      kisi aik column ka name dia hai .... to ye parameter hm iss liye use krty hn k agr hmko
                                      kisi aik specific column mn se NAN value ko remove krna ho)

In [ ]:
csv_1.dropna(inplace=True) !Note (iss mn hm sbi NAN value ho htta kr uski jga koi new value place krskty hn)

In [ ]:
csv_1.dropna(thresh=1) !Note (ye thresh hm kisi NAN value ko remove krny k liye use kr rhy hn thresh=1 ka mtlb hai k kis column
                             mn aik NAN value hai usy htta do.....iss 1 ki value ko hm apny according chang krskty hn like 1,2
                             jo b dyna chahy hm dyskty according to our need)

### Fillna

In [ ]:
csv_1.fillna("c++") !Note (fillna("c++") ka mtlb hai k sary data mn hmary pas jahna jahn b NAN value hai usko hm c++ se fill 
                          krna chah rhy hn .... () mn dbl quots mn hm vo value likhty hn jo hm NAN ki jga likhna chah rhy
                          hoty hn)

In [ ]:
csv_1.fillna({"a":"robi","b":"php",'c':"laravel"})   !Note (agr hm kisi particular column k andr particular data ko pas krwana 
                                                            chahty hn)

In [ ]:
csv_1.fillna(method="ffill")  !Note (agr hm chahty hn k NAN value apni previous value se fill ho jaye ... to isky 
                                      liye hm method ka use kren gy r isky 2 parameters hoty hn aik h forward filling r dosra h 
csv_1.fillna(method="bfill")          backword filling)

csv_1.fillna(method="bfill",axis=1) 

csv_1.fillna(method="bfill",axis=0)

In [ ]:
csv_1.fillna(12,inplace=True)    !Note (how to use inplace ... inplace ki value true ya false hoti hai)

In [ ]:
csv_1.fillna("python",limit=2)  !Note (yani hm aik limit bta dyty hn k jis column mn NAN h us mn python set krdo yani minimum
                                      NAN 2 hon jis mn)

### Replace

In [ ]:
* runtime pr kisi data ko replace kr k uski jga koi dosra data rkhna to usky liye hm replace ka use krty hn

In [ ]:
csv_1.replace(to_replace=1,value=22) !Note (replace ka function value ko replace krny k liye use hota hai ... to_replace ka
                                                   mtlb hai k hm kis chz ko replace krna chah rhy hn r value ka mtlb hai k hm kya value
csv_1.replace(to_replace="pthon",value="c++")       dyna chah rhy hn us ki jga)

csv_1.replace([1,2,3,4,5],22)               !Note ([1,2,3,4,5] ye index numbers hein r jo 22 hai ye vo value h jo uski jga 
                                                   replace hogi jahan jahan b in index pr numeric values hn)

csv_1.replace("[A-Za-z]","c++",regex=True)  !Note (regex parameter ko use krty huye value ko replace kia h yahn capital A-Z
                                                   se lykr small a-z tk ki value ko c++ se replace kia h yahan) 

csv_1.replace({"b":"[A-Z]"},22,regex=True)  !Note (dictionary ko use krty huye value ko replace krna)

In [ ]:
csv_1.replace(1,method="ffill")   !Note (replace mn method function ko use krty huye value replace krna)

In [ ]:
csv_1.replace(1,method="ffill",limit=2)  !Note (limit ka use krty huye value ko replace krna mtlb k hm kitni value ko replace
                                               krna chahty hn to usky liye hm ny aik limit set krdi ye treeqa copy bna kr us 
                                               mn change krta hai)

csv_1.replace(1,method="ffill",limit=2,inplace,True) !Note (ye orignal mn change kry ga values ko koi copy nii bnaye ga)

### Interpolate

> Missing data ko automatically fill krny k liye use kren gy .... automatic ka matlb ye ni hai koi b data fill hojaye ga
  akr blky ye pichly data k sequence se observe krta hai r usky according data fill hoga .... means apny ap sequence wise data     fill krdy ga...iss mn hmko khud se data nii dyna prta fill krny k liye ....interpolate sirf numeric values k liye work krta
  hai ya ap keh lijiye digits/number k liye hi

csv_1.interpolate()

In [ ]:
csv_1.interpolate(method="linear",axis=1)

In [ ]:
csv_1.interpolate(method="linear",axis=1,limit=2)

In [ ]:
csv_1.interpolate(limit_direction="forward",limit=2) !Note (yahan limit_direction ka use kia gya hai limit ki direction
                                                           btany k liye to ye direction forward b hoskti hai backword bhi
                                                           hoskti hai r both b hoskti hai)
csv_1.interpolate(limit_direction="backward",limit=2)
csv_1.interpolate(limit_direction="both",limit=2)

In [ ]:
csv_1.interpolate(limit_area="inside")    !Note (limit area hm isliye use krty hn taky hm bta skein k yahan hm ny 
                                                     interpolate ko use krna hai ya ni krna hai to hm aik area specify kr 
                                                     dyty hn)
csv_1.interpolate(limit_area="outside")

# Merging & Concat in python pandas (2 ya 2 se zyada DataFrames ko hm kesy merge kren gy etc)

### Merge

In [ ]:
* DataFrames ko merge krny k liye hmary pas in mn koi aik chz comman honi chahiye like Id etc

In [2]:
import pandas as pd

var1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

var2=pd.DataFrame({"A":[1,2,3,4],"C":[22,33,44,55]})

pd.merge(var1,var2,on="A")

pd.merge(var2,var1,on="A")

!Note (hmary pas jitni b chz common hogi iss mn us hisab se hmary pas new dataset ajaye ga)

   A   C   B
0  1  22  11
1  2  33  12
2  3  44  13
3  4  55  14

In [ ]:
var1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

var2=pd.DataFrame({"A":[1,2,3,5],"C":[22,33,44,55]})  (yahan "A" mn 2 value alg alg hn like 4 and 5 means ye common nii hai to
                                                      merge krty huye ye 2 value show nii hongi baqi jo values A mn common hn
                                                      vo show ho jaye gi .... to jo value common ni hn like 4 and 5 inko bhi
                                                      show krwany k liye hm how ka use kren gy)

pd.merge(var1,var2,how="inner")   (ye how ki inner value bydefault hoti hai iss se koi asr nii prta)

pd.merge(var1,var2,how="left")    (yahan isky liye var1 left hai to ye var1 k sary data k according dataset show kry ga)

pd.merge(var1,var2,how="right")   (yahan isky liye var2 right hai to ye var2 k sary data k according dataset show kry ga)

pd.merge(var1,var2,how="outer")   (yahan ye dono var1 and var2 k sary data k according dataset show kry ga)

pd.merge(var1,var2,indicator=True)  (indicator=True ye dekhny k liye h k hmary pas kon konse data present hai r merge hochuky
                                    hn r kon kon se data hn jo present b ni r abi tk merge b ni huye hn)

In [3]:
var1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

var2=pd.DataFrame({"A":[1,2,3,5],"C":[22,33,44,55]}) 

pd.merge(var1,var2,left_index=True,right_index=True)

   A_x   B  A_y   C
0    1  11    1  22
1    2  12    2  33
2    3  13    3  44
3    4  14    5  55

In [5]:
* agr hm in columns like A_x,B,A_y,C ko koi name dyna chahty hn to usky liye hn suffixes ka method use kren gy


var1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

var2=pd.DataFrame({"A":[1,2,3,5],"C":[22,33,44,55]}) 

pd.merge(var1,var2,left_index=True,right_index=True,suffixes=("name","id"))

   Aname   B  Aid   C
0      1  11    1  22
1      2  12    2  33
2      3  13    3  44
3      4  14    5  55

### Concate

* Concate bhi hmary pas 2 dataFrames ya 2 series ko jorny k kam ata hai
* ye common ko ni dekhta bs kisi b 2 dataframe ya series ko aps mn join kr dyta hai chahy vo common hon ya ni hon

In [7]:
series1=pd.Series([1,2,3,4])

series2=pd.Series([11,22,33,44])

pd.concat([series1,series2])

0     1
1     2
2     3
3     4
0    11
1    22
2    33
3    44
dtype: int64

In [8]:
v1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

v2=pd.DataFrame({"A":[1,2,3,5],"C":[22,33,44,55]}) 

pd.concat([v1,v2])

   A     B     C
0  1  11.0   NaN
1  2  12.0   NaN
2  3  13.0   NaN
3  4  14.0   NaN
0  1   NaN  22.0
1  2   NaN  33.0
2  3   NaN  44.0
3  5   NaN  55.0

In [9]:
v1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

v2=pd.DataFrame({"A":[1,2,3,5],"C":[22,33,44,55]}) 

pd.concat([v1,v2],axis=1) (yahan ye column k hisab se concat kr raha hai q k yahan hm ny axis mn axis=1 dia hai)

   A   B  A   C
0  1  11  1  22
1  2  12  2  33
2  3  13  3  44
3  4  14  5  55

In [11]:
v1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

v2=pd.DataFrame({"A":[1,25],"C":[22,55]}) 

pd.concat([v1,v2],join="inner")  !Note(yahan hm join ki value inner ya outer dyskty hn .... inner union k liye r outer
                                      intersection k liye hai)

    A
0   1
1   2
2   3
3   4
0   1
1  25

In [13]:
v1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

v2=pd.DataFrame({"A":[1,2,3,5],"C":[22,33,44,55]}) 

pd.concat([v1,v2],axis=1,keys=["v1","v2"])

  v1     v2
   A   B  A   C
0  1  11  1  22
1  2  12  2  33
2  3  13  3  44
3  4  14  5  55

In [14]:
v1=pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})

v2=pd.DataFrame({"A":[1,2,3,5],"C":[22,33,44,55]}) 

pd.concat([v1,v2],axis=0,keys=["v1","v2"])

      A     B     C
v1 0  1  11.0   NaN
   1  2  12.0   NaN
   2  3  13.0   NaN
   3  4  14.0   NaN
v2 0  1   NaN  22.0
   1  2   NaN  33.0
   2  3   NaN  44.0
   3  5   NaN  55.0

In [15]:
v1=pd.DataFrame({"A":[1,2,3,4]})

v2=pd.DataFrame({"A":[1,2,3,5],"C":[22,33,44,55]}) 

pd.concat([v1,v2])

   A     C
0  1   NaN
1  2   NaN
2  3   NaN
3  4   NaN
0  1  22.0
1  2  33.0
2  3  44.0
3  5  55.0

# Group by in python Pandas

* mtlb k agr hm ny apni csv ya excel file mn koi b data randomly idr odr bkheer rkha hai to usko kesy sequence wise arranhe krna
  hai to usko hm iss mn dekhy gy.
* aik trhan se ye sequance mn sort sa kr raha h hmara data

### GroupBy

In [17]:
var=pd.DataFrame({"Name":["a","b","c","b","d","a","b","a","c"],
                 "Sub_1":[11,12,13,14,15,16,17,18,19],
                 "Sub_2":[11,12,13,14,15,16,17,18,19]})
var

  Name  Sub_1  Sub_2
0    a     11     11
1    b     12     12
2    c     13     13
3    b     14     14
4    d     15     15
5    a     16     16
6    b     17     17
7    a     18     18
8    c     19     19

In [21]:
var_new=var.groupby("Name")

for x,y in var_new:
    print(x)
    print(y)

a
  Name  Sub_1  Sub_2
0    a     11     11
5    a     16     16
7    a     18     18
b
  Name  Sub_1  Sub_2
1    b     12     12
3    b     14     14
6    b     17     17
c
  Name  Sub_1  Sub_2
2    c     13     13
8    c     19     19
d
  Name  Sub_1  Sub_2
4    d     15     15

In [22]:
var_new.get_group("a")  !Note (ye method use kia hai kisi bhi aik specific group ka data fetch krny k liye)

  Name  Sub_1  Sub_2
0    a     11     11
5    a     16     16
7    a     18     18

In [23]:
var_new.min()

      Sub_1  Sub_2
Name
a        11     11
b        12     12
c        13     13
d        15     15

In [24]:
var_new.max()

      Sub_1  Sub_2
Name
a        18     18
b        17     17
c        19     19
d        15     15

In [25]:
var_new.mean()

          Sub_1      Sub_2
Name
a     15.000000  15.000000
b     14.333333  14.333333
c     16.000000  16.000000
d     15.000000  15.000000

In [26]:
li=list(var_new)
li

[('a',
    Name  Sub_1  Sub_2
  0    a     11     11
  5    a     16     16
  7    a     18     18),
 ('b',
    Name  Sub_1  Sub_2
  1    b     12     12
  3    b     14     14
  6    b     17     17),
 ('c',
    Name  Sub_1  Sub_2
  2    c     13     13
  8    c     19     19),
 ('d',
    Name  Sub_1  Sub_2
  4    d     15     15)]

# Join and Append DataFrames |

### Join

In [2]:
import pandas as pd

var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20,30,40],"D":[11,22,33,44]})

var1.join(var2)

   A   B   C   D
0  1  11  10  11
1  2  12  20  22
2  3  13  30  33
3  4  14  40  44

In [3]:
import pandas as pd

var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]})  !Note (it also works for unmatch data)

var1.join(var2)

   A   B     C     D
0  1  11  10.0  11.0
1  2  12  20.0  22.0
2  3  13   NaN   NaN
3  4  14   NaN   NaN

In [7]:
import pandas as pd

var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])  
!Note (we also give indexes)
var1.join(var2)

   A   B     C     D
a  1  11  10.0  11.0
b  2  12  20.0  22.0
c  3  13   NaN   NaN
d  4  14   NaN   NaN

In [8]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])  

var2.join(var1,how="right")

      C     D  A   B
a  10.0  11.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

In [9]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[11,22]},index=["a","b"])  

var2.join(var1,how="inner")

    C   D  A   B
a  10  11  1  11
b  20  22  2  12

In [12]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"B":[11,22]},index=["a","b"])  
!Note we use lsuffix and rsuffix to change the same column names at the run time
var2.join(var1,how="right",lsuffix="_12",rsuffix="_13")

      C  B_12  A  B_13
a  10.0  11.0  1    11
b  20.0  22.0  2    12
c   NaN   NaN  3    13
d   NaN   NaN  4    14

### Append

In [16]:
import pandas as pd
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"B":[11,22]},index=["a","b"])  
!Note we can append two same columns without using lsuffix and rsuffix
var1.append(var2)

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
we can resolve this error like this below

In [17]:
pd.concat([var1,var2])

     A   B     C
a  1.0  11   NaN
b  2.0  12   NaN
c  3.0  13   NaN
d  4.0  14   NaN
a  NaN  11  10.0
b  NaN  22  20.0

In [19]:
pd.concat([var1,var2],ignore_index=True)  !Note (this ignore_index=True is used to ignore the index like in the above line we
                                                find index repeatedly so to avoid this we use ignore_index=True )

     A   B     C
0  1.0  11   NaN
1  2.0  12   NaN
2  3.0  13   NaN
3  4.0  14   NaN
4  NaN  11  10.0
5  NaN  22  20.0